       identification division.
       program-id. SmallProgram.
       author. kl.cheng

       PROCEDURE DIVISION.
       DISPLAY "hello world".
       STOP RUN.